; domain
(define (domain blocksworld)
  (:requirements :strips :constraints :negative-preconditions)
  (:predicates (pred_1 ?v3)
               (pred_3 ?v3)
               (pred_4)
               (pred_2 ?v3)
               (pred_5 ?v3 ?v2))

  (:action op_2
    :parameters (?v1)
    :precondition (and (pred_1 ?v1) (pred_3 ?v1) (pred_4))
    :effect (and (pred_2 ?v1) (not (pred_1 ?v1)) (not (pred_3 ?v1)) 
                 (not (pred_4))))

  (:action op_1
    :parameters  (?v1)
    :precondition (pred_2 ?v1)
    :effect (and (pred_1 ?v1) (pred_4) (pred_3 ?v1) 
                 (not (pred_2 ?v1))))

  (:action op_4
    :parameters  (?v1 ?v4)
    :precondition (and (pred_1 ?v4) (pred_2 ?v1))
    :effect (and (pred_4) (pred_1 ?v1) (pred_5 ?v1 ?v4)
                 (not (pred_1 ?v4)) (not (pred_2 ?v1))))

  (:action op_3
    :parameters  (?v1 ?v4)
    :precondition (and (pred_5 ?v1 ?v4) (pred_1 ?v1) (pred_4))
    :effect (and (pred_2 ?v1) (pred_1 ?v4)
                 (not (pred_5 ?v1 ?v4)) (not (pred_1 ?v1)) (not (pred_4)))))

; problem
(define (problem BW-rand-6)
(:domain blocksworld)
(:objects obj_05 obj_06 obj_03 obj_04 obj_02 obj_01 )
(:init
(pred_4)
(pred_3 obj_05)
(pred_3 obj_06)
(pred_5 obj_03 obj_04)
(pred_5 obj_04 obj_06)
(pred_5 obj_02 obj_05)
(pred_5 obj_01 obj_02)
(pred_1 obj_03)
(pred_1 obj_01)
)
(:goal
(and
(pred_5 obj_06 obj_01)
(pred_5 obj_03 obj_02)
(pred_5 obj_02 obj_06))
)

(:constraints
  (sometime-before (pred_5 obj_03 obj_02) (pred_5 obj_06 obj_01))
)
)

; plan
1. (op_3 obj_01 obj_02)
   deleted: (pred_5 obj_01 obj_02) (pred_1 obj_01) (pred_4)
   added: (pred_2 obj_01) (pred_1 obj_02)
   goals met: 0 of 3
2. (op_1 obj_01)
   deleted: (pred_2 obj_01)
   added: (pred_1 obj_01) (pred_4) (pred_3 obj_01)
   goals met: 0 of 3
3. (op_3 obj_03 obj_04)
   deleted: (pred_5 obj_03 obj_04) (pred_1 obj_03) (pred_4)
   added: (pred_2 obj_03) (pred_1 obj_04)
   goals met: 0 of 3
4. (op_1 obj_03)
   deleted: (pred_2 obj_03)
   added: (pred_1 obj_03) (pred_4) (pred_3 obj_03)
   goals met: 0 of 3
5. (op_3 obj_04 obj_06)
   deleted: (pred_5 obj_04 obj_06) (pred_1 obj_04) (pred_4)
   added: (pred_2 obj_04) (pred_1 obj_06)
   goals met: 0 of 3
6. (op_1 obj_04)
   deleted: (pred_2 obj_04)
   added: (pred_1 obj_04) (pred_4) (pred_3 obj_04)
   goals met: 0 of 3
7. (op_2 obj_06)
   deleted: (pred_1 obj_06) (pred_3 obj_06) (pred_4)
   added: (pred_2 obj_06)
   goals met: 0 of 3
8. (op_4 obj_06 obj_01)
   deleted: (pred_1 obj_01) (pred_2 obj_06)
   added: (pred_4) (pred_1 obj_06) (pred_5 obj_06 obj_01)
   goals met: 1 of 3
9. (op_3 obj_02 obj_05)
   deleted: (pred_5 obj_02 obj_05) (pred_1 obj_02) (pred_4)
   added: (pred_2 obj_02) (pred_1 obj_05)
   goals met: 1 of 3
10. (op_4 obj_02 obj_06)
   deleted: (pred_1 obj_06) (pred_2 obj_02)
   added: (pred_4) (pred_1 obj_02) (pred_5 obj_02 obj_06)
   goals met: 2 of 3
11. (op_2 obj_03)
   deleted: (pred_1 obj_03) (pred_3 obj_03) (pred_4)
   added: (pred_2 obj_03)
   goals met: 2 of 3
12. (op_4 obj_03 obj_02)
   deleted: (pred_1 obj_02) (pred_2 obj_03)
   added: (pred_4) (pred_1 obj_03) (pred_5 obj_03 obj_02)
   goals met: 3 of 3
